/**
 * @file delete.h
 * @brief Този файл декларира функции за изтриване на записи на имоти от системата.
 *
 * Той предоставя функционалности за премахване на един имот по неговия референтен номер
 * или за изчистване на всички имоти, съхранени в момента в системата, с потвърждение от потребителя.
 */

#ifndef DELETE_H
#define DELETE_H

#include "structs.h" 

/**
 * @brief Изтрива един имот от системата въз основа на неговия референтен номер.
 * @param properties Масив от структури Property, от които да се изтрива.
 * @param propertyCount Референция към цяло число, представляващо текущия брой имоти.
 *
 * Подканва потребителя за референтен номер на имот, потвърждава изтриването
 * и след това измества елементите на масива, за да запази последователността.
 */
void DeleteProperty(Property properties[], int& propertyCount);

/**
 * @brief Изтрива всички имоти, съхранени в момента в системата.
 * @param properties Масив от структури Property, които да бъдат изчистени.
 * @param propertyCount Референция към цяло число, представляващо текущия брой имоти.
 *
 * Изисква изрично потвърждение от потребителя, за да се предотврати случайна загуба на данни.
 * Ефективно нулира списъка с имоти до празно състояние.
 */
void DeleteAllProperties(Property properties[], int& propertyCount);

#endif 
