/**
 * @file reports.h
 * @brief Този файл декларира функции за генериране на различни аналитични отчети за данни за имоти.
 *
 * Той включва функционалности за идентифициране на най-скъпите имоти, изчисляване на
 * средните цени в конкретни райони и определяне на процентите на продажби на брокер,
 * предоставяйки ценни прозрения за пазара на недвижими имоти.
 */

#ifndef REPORTS_H
#define REPORTS_H

#include "structs.h" 

/**
 * @brief Намира и показва най-скъпия имот в указан от потребителя район.
 * @param properties Масив от структури Property за анализ.
 * @param propertyCount Броят на имотите в масива.
 *
 * Този отчет помага за идентифициране на премиум обяви в конкретни географски местоположения.
 */
void mostExpensiveInArea(const Property properties[], int propertyCount);

/**
 * @brief Изчислява и показва средната цена на имотите в указан от потребителя район.
 * @param properties Масив от структури Property за анализ.
 * @param propertyCount Броят на имотите в масива.
 *
 * Предоставя пазарна информация чрез осредняване на цените, полезна за ценови стратегии и информация за купувачи.
 */
void averagePriceInArea(const Property properties[], int propertyCount);

/**
 * @brief Изчислява и показва процента на продадените имоти от всеки брокер.
 * @param properties Масив от структури Property за анализ.
 * @param propertyCount Броят на имотите в масива.
 *
 * Този отчет предлага показатели за ефективността на отделните брокери, подчертавайки ефективността на продажбите.
 */
void soldPercentagePerBroker(const Property properties[], int propertyCount);

#endif 
