/**
 * @file search.h
 * @brief Този файл декларира функции за търсене на имоти въз основа на различни критерии.
 *
 * Той предоставя функционалности за филтриране и показване на имоти, съвпадащи със специфични
 * условия, като името на брокера или броя стаи.
 */

#ifndef SEARCH_H
#define SEARCH_H

#include "structs.h" 

/**
 * @brief Търси и показва имоти, обработени от конкретен брокер.
 * @param properties Масив от структури Property, в който да се търси.
 * @param propertyCount Броят на имотите в масива.
 *
 * Подканва потребителя за име на брокер и след това итерира през имотите,
 * показвайки тези, които съвпадат.
 */
void searchByBroker(Property properties[], int propertyCount);

/**
 * @brief Търси и показва имоти въз основа на броя стаи.
 * @param properties Масив от структури Property, в който да се търси.
 * @param propertyCount Броят на имотите в масива.
 *
 * Подканва потребителя за брой стаи и след това итерира през имотите,
 * показвайки тези, които съвпадат или надвишават указания брой.
 */
void searchByRooms(Property properties[], int propertyCount);

#endif 
