/**
 * @file sort.h
 * @brief Този файл декларира функции за сортиране на масиви от имоти.
 *
 * Той предоставя реализация на алгоритъма QuickSort, адаптиран за структури `Property`,
 * позволявайки имотите да бъдат сортирани въз основа на различни критерии (напр. цена, площ)
 * във възходящ или низходящ ред.
 */

#ifndef SORT_H
#define SORT_H

#include "structs.h" 

/**
 * @brief Сортира масив от структури Property, използвайки алгоритъма QuickSort.
 * @param arr Масивът от структури Property, който ще бъде сортиран.
 * @param size Броят на елементите в масива.
 * @param sortAscending Булев флаг: true за възходящ ред, false за низходящ.
 *
 * Това е основната входна точка за сортиране на имоти. В момента сортира по цена.
 * Реализацията вътрешно извиква `quickSort` след инициализиране на процеса на сортиране.
 */
void sortPropertiesArray(struct Property arr[], int size, bool sortAscending);

/**
 * @brief Разделя масива около елемент на опора (pivot).
 * @param arr Масивът, който ще бъде разделен.
 * @param low Началният индекс на подмасива за разделяне.
 * @param high Крайният индекс на подмасива за разделяне.
 * @param sortAscending Булев флаг, указващ реда на сортиране (true за възходящ).
 * @return Индексът на елемента на опора след разделянето.
 *
 * Това е помощна функция за алгоритъма QuickSort, която пренарежда елементите
 * така, че елементи, по-малки (или по-големи, в зависимост от реда на сортиране) от pivot,
 * да идват преди (или след) него.
 */
int partition(struct Property arr[], int low, int high, bool sortAscending);

/**
 * @brief Реализира алгоритъма QuickSort за сортиране на масив от структури Property.
 * @param arr Масивът от структури Property, който ще бъде сортиран.
 * @param low Началният индекс на подмасива за сортиране.
 * @param high Крайният индекс на подмасива за сортиране.
 * @param sortAscending Булев флаг, указващ реда на сортиране (true за възходящ).
 *
 * Тази рекурсивна функция ефективно сортира имотите на място въз основа на
 * избрания критерий (в момента цена).
 */
void quickSort(struct Property arr[], int low, int high, bool sortAscending);

/**
 * @brief Разменя местата на две структури Property.
 * @param a Указател към първата структура Property.
 * @param b Указател към втората структура Property.
 *
 * Помощна функция, използвана от алгоритъма за сортиране за размяна на позициите на елементи.
 */
void swap(struct Property* a, struct Property* b);

#endif 
