/**
 * @file utils.h
 * @brief Този файл декларира различни помощни функции, използвани в приложението.
 *
 * Тези функции предоставят общи функционалности като манипулиране на конзолата,
 * управление на директории, обработка на потребителски вход и показване на банери на приложението.
 */

#ifndef UTILS_H
#define UTILS_H

/**
 * @brief Изчиства екрана на конзолата.
 *
 * Тази функция използва специфични за системата команди за изчистване на терминала,
 * осигурявайки по-чисто потребителско изживяване.
 */
void clearConsole();

/**
 * @brief Отпечатва банера на приложението на конзолата.
 *
 * Тази функция обикновено се извиква при стартиране на приложението или
 * при връщане към главното меню за показване на приветствено съобщение или лого.
 */
void printBanner();

/**
 * @brief Гарантира, че указаният път до директория съществува. Ако не, се опитва да я създаде.
 * @param path Пътят до директорията за проверка/създаване.
 *
 * Това е от решаващо значение за управление на постоянно съхранение, като файлове с данни или регистрационни файлове за възстановяване,
 * гарантирайки, че приложението има необходимата файлова системна структура преди операции.
 */
void ensureDirectoryExists(const char* path);

/**
 * @brief Подканва потребителя да въведе избор от меню и валидира входа.
 * @param min Минималният валиден избор.
 * @param max Максималният валиден избор.
 * @return Валидираният цялочислен избор, въведен от потребителя.
 *
 * Тази функция подобрява потребителското изживяване, като гарантира, че входът за избор от менюто
 * попада в очакваните граници, обработвайки невалидни записи грациозно.
 */
int getMenuChoice(int min, int max);

/**
 * @brief Подканва потребителя за потвърждение с да/не.
 * @param prompt Съобщението, което да се покаже на потребителя за потвърждение.
 * @return true, ако потребителят потвърди (въведе 'y' или 'Y'), в противен случай false.
 *
 * Използва се за критични действия, където е необходимо изрично съгласие на потребителя преди продължаване.
 */
bool getConfirmation(const char* prompt);

#endif 
