/**
 * @file main.cpp
 * @brief Главна входна точка за приложението "Система за управление на недвижими имоти".
 *
 * Този файл съдържа функцията `main`, която инициализира приложението,
 * зарежда първоначални данни, обработва избора на език, показва банера на приложението
 * и след това влиза в цикъла на главното меню. Тя оркестрира цялостния поток на програмата.
 */

#include "structs.h"       
#include "file.h"          
#include "utils.h"         
#include "menu.h"          
#include "localization.h"  

/**
 * @brief Входна точка на приложението "Система за управление на недвижими имоти".
 *
 * Тази функция изпълнява следните критични задачи при стартиране:
 * 1. Инициализира масив за съхранение на данни за имоти и задава първоначалния брой имоти на нула.
 * 2. Зарежда преводите на езика по подразбиране (български) и след това позволява на потребителя да избере предпочитания от него език.
 * 3. Показва приветствения банер на приложението.
 * 4. Опитва се да зареди предварително запазени данни за имоти от текстов файл за синхронизация,
 *    възстановявайки състоянието на приложението от последната сесия.
 * 5. Влиза в цикъла на главното меню, позволявайки на потребителя да взаимодейства със системата.
 *
 * @return int Връща 0 при успешно изпълнение и прекратяване на програмата.
 */
int main() {
  Property properties[MAX_PROPERTIES]; 
  int propertyCount = 0; 

  
  loadTranslations("bg");

  
  printBanner();

  
  selectLanguage();

  
  
  loadFromSyncTextFile(properties, propertyCount);

  
  
  mainMenu(properties, propertyCount);

  return 0; 
}